In [2]:
import pandas as pd

In [11]:
df1 = pd.read_csv('sqli.csv' , encoding = 'UTF-16')
df2 = pd.read_csv('sqliv2.csv' , encoding = 'UTF-16')
#df3 = pd.read_csv('SQLiV3.csv' , encoding = 'UTF-16')

In [15]:
df2.head()

          Sentence  Label
0                a      1
1              a'       1
2            a' --      1
3  a' or 1 = 1; --      1
4                @      1

In [17]:
df2.shape

(33761, 2)

In [16]:
df1.head()

          Sentence  Label
0                a      1
1              a'       1
2            a' --      1
3  a' or 1 = 1; --      1
4                @      1

In [18]:
df1.shape

(4200, 2)

In [22]:
combined_df = pd.concat([df1, df2], ignore_index=True)

In [23]:
combined_df.head()

          Sentence  Label
0                a      1
1              a'       1
2            a' --      1
3  a' or 1 = 1; --      1
4                @      1

In [25]:
combined_df.tail()

               Sentence  Label
37956            syrett      0
37957  arrechea bellveh      0
37958              1664      0
37959          almaluez      0
37960         f6lo40r06      0

In [26]:
combined_df.isnull().sum()

Sentence    17
Label        0
dtype: int64

In [28]:
df.duplicated().sum()

248

In [29]:
new_df = df.drop_duplicates()

In [31]:
new_df.shape

(3952, 2)

In [34]:
new_df = df.dropna()

In [35]:
new_df.shape

(4187, 2)

In [36]:
new_df.isnull().sum().sum()

0

In [37]:
new_df.duplicated().sum()

237

In [38]:
new_df = new_df.drop_duplicates()

In [39]:
new_df.shape

(3950, 2)

In [40]:
import numpy as np 
import matplotlib.pyplot as plt